[
    {
        "title": "Mee Ayam (Chicken with Egg Noodles)",
        "ingredients": "8 oz Chicken breast|1 1/2 Dry egg noodles|2 Stalks spring onions|2 tb Soya sauce|1 tb Oyster sauce|1 Teacup chicken stock or water|1 tb Oil|1 Red chilli; (slices) - optional|2 Stalks coriander",
        "servings": "1 servings",
        "instructions": "Soak the noodles in boiling water for a minute. Drain in a colander and rinse well with cold water. Squeeze off excess water. Slice the chicken breast into thin pieces. Heat the oil in a wok and add the chicken pieces and the noodles and stir. Add the soya sauce and the oyster sauce and continue to stir. Leave for two minutes to soak. Remove onto a plate and serve hot. Garnish with slices of chilli and coriander."
    },
    {
        "title": "All-In-One Ayam Curry (Chicken Curry)",
        "ingredients": "2 1/2 lb Chicken; (whole)|2 tb Salt|1 ts Sugar|4 Floz water or stock|1 1/2 tb Oil|4 lg Onions; chopped|2 Cloves garlic|1 ts Chilli powder; (optional)",
        "servings": "1 servings",
        "instructions": "Wash and clean the chicken. Chop or cut into medium chunks. Heat the oil, garlic and the onion and add the curry powder, the salt, the sugar and the chicken. Stir well on medium heat for ten minutes. Add the chicken stock or water, leave for a further 15 minutes to simmer. Serve with boiled rice."
    },
    {
        "title": "Soto Ayam (Chicken Soup)",
        "ingredients": "1 Chicken, 3-3 1/2 lbs.|1 tb Salad oil|4 Garlic clove; smashed and pe|1 Onion; coarsley chopped|2 tb Ginger, fresh; chopped|1 Lemon grass stalk|1/4 c Lemon grass; sliced|Lemon zest|1 Galangal slice; dry|1 ts Turmeric|1 ts Salt|2 ts Coriander, ground|2 ts Sugar|1/4 ts Pepper|28 oz Chicken broth Water|1 1/2 tb Lemon juice|Condiments (noted in directi",
        "servings": "6 Servings",
        "instructions": "Remove chicken giblets, set aside. Pull off and discard lumps of fat from chicken. Cut off wings and leg-and-thigh pieces. Separate back from breast. Pour oil into 6 quart kettle and place over medium heat. Add garlic, onion, and ginger and cook, stirring until onion is soft. Add lemon grass, galangal, tumeric, salt, coriander, sugar, pepper, broth, and water. Stir then add chicken and giblets (except liver). Bring to a boil over high heat. Cover, reduce heat, and simmer until breast is no longer pink when slashed (15-20 minutes). Remove breast and let cool. Simmer remaining chicken until meat near thighbone is no longer pink when slashed (15 minutes more). Lift out legs and thighs, let cool. Continue to simmer broth. Discard skin from breast, legs and thighs. Cut meat into bite-sized pieces. Cover and set aside. Return bones to broth, continue simmering until broth is richly flavored (about 1 more hour). Strain, discard wings, back, bones, giblets, and seasonings. (At this point you may cover and refrigerate chicken and broth until next day. Bring chicken to room temperature before serving.) Prepare condiments and crisp-fried onions. Place condiments, onions and chicken in seperate bowls. Skim and discard fat from broth. Heat broth until steaming and stir in lemon juice. Ladle broth into serving bowls. Let diners add chicken, condiments and crisp-fried onions. CONDIMENTS: Offer at least two of the following: 2 ounces bean threads, cut into 6-inch lengths (soak in warm water to cover for 30 minutes before cutting), or 1 1/2 cups cooked rice; 1 1/2 cups bean sprouts mixed with 1/4 cup chopped celery leaves; Spiced Coconut; and Chili Paste. Crisp-fried onions: Cut 2 medium onions in half lengthwise. Cut each half crosswise into even slices about 1/8 inch thick; then cut slices into halves or thirds to make smaller arcs. Into a deep heavy pan pour salad oil to a depth of 1 inch and heat to 300 F. Add about a third of the onions and cook, stirring often, until lightly browned (4-5 minutes). Oil temperature will drop at first, but rise again as the onions brown; regulate heat to maintain 300 F. Remove onions with a slotted spoon; drain on paper towels. Repeat with remaining onions. Serve warm or at room temperature. Makes about 1 1/2 cups. --- per Larry Haftl"
    },
    {
        "title": "Soto Ayam (Javanese Style Chicken Soup)",
        "ingredients": "2 Cloves garlic; sliced|1/4 ts Turmeric|1/4 ts Pepper|1 ts Fresh ginger; chopped|1 tb Vegetable oil|1 Whole young chicken; (± 3lbs), quartered|5 c Water|2 Salam leaves; (bay leaves)|4 Scallions; finely chopped|3 ts Salt|2 Stalks lemongrass|2 sm Package vermicelli|Lime slices|2 Hard-boiled eggs; sliced|Crispy fried shallots|Sweet soy sauce|Hot chili sauce; (sambal) - ???",
        "servings": "1 servings",
        "instructions": "Blend turmeric, garlic, ginger, and pepper into a paste. Heat 1 Tbs. vegetable oil in a wok with medium heat, stir fry the paste for a minute or two until fragrant. Put the chicken into a big pot that is filled with water, salam leaves, two of the scallions,salt, lemongrass and the fried spice paste. Cook covered over medium heat for thirty minutes. Turn off theheat, and let the chicken stand in its broth for about  fifteen minutes to absorb the flavor. Take the chicken out and let it cool off. Then remove the meat from its bones and thinly slice it into bite-size pieces (you can either use the fork or your hands to do this instead of using a knife) and discard the bones. Soak the vermicelli in hot water for 15 minutes or you can boil it, drain well. To serve, prepare separate side dishes of chicken,  the rest of the scallions, vermicelli, lemon slices, hot chili sauce, hard-boiled egg slices, crispy fried shallots and sweet soy sauce. This particular dish is best eaten with steamed rice, so arrange in layers in the individual soup bowl, a cup of steam rice, a tablespoon of chicken, vermicelli, scallions, egg slices, a few drops of sweet soy sauce and hot chili sauce. Then pour a very hot chicken broth/soup and squeeze a slice of lemon and top with the crispy fried shallots. Ready to serve. Makes 6-8 servings."
    },
    {
        "title": "Sate Ayam - Chicken Satay",
        "ingredients": "1 Lime|Creamy Peanut butter|Arenga Candy; (Gula Jawa)|Vegetable Oil|Sweet soy sauce|Chicken; (cut in small squares)|Bamboo skewers",
        "servings": "1 servings",
        "instructions": "A very simplified version for people who don't have a barbeque grill Squeeze lime juice onto diced chicken. Put about 4 pieces of diced chicken on each skewer. Heat about 1 cup of peanut butter. Add about 1/3 lb to 1/2 lb of arenga candy and stir until all candy is mixed in the peanut butter. Drain excess oil and add about 2 tablespoon of sweet soy sauce. Marinadethe skewered chicken with the sauce and leave for about 1 hour. Before frying, mix some oil and sweet soy sauce on a plate. Coat the skeweredchicken in it and fry it on a wide saucepan on medium heat. Lift when cooked. Serve with or without peanut sauce Peanut sauce: Mix peanut butter, arenga candy, and sweet soy sauce to taste. Heat over medium heat. Drain excess oil. Squeeze some lime juice and put some fried shallots prior to serving."
    },
    {
        "title": "Opor Ayam (Coconut Chicken Curry)",
        "ingredients": "1 Broiler or fryer|Chicken with skin, approx.|450g.|2 ts Salt|1 lg Onion, chopped finely|3 Cloves garlic, chopped|3 tb Oil|1 tb Coriander|Pinch of chopped ginger|1 ts Ground lemon grass|2 c Coconut milk|1 Salam leaf",
        "servings": "4 Servings",
        "instructions": "Cut chicken into serving portions and rub with salt. Fry onion and garlic in oil until lightly brown. Now, add coriander, ginger and lemon grass. Stir well for about 1 minute. Add chicken, mixing thoroughly so that chicken absorbs the spices. Add coconut milk and salam leaf. Cover tightly and cook over medium heat for about 40 minutes. Serve with rice."
    },
    {
        "title": "Ayam Gorem (Deep Fried Chicken with a Sweet Sauce)",
        "ingredients": "500 g Chicken breast; (boneless)|2 tb Soya sauce|1 Lime; (squeezed)|1 ts Salt|1 ts Pepper|1 Onion; (chopped)|2 Red chilli; (crushed)|2 tb Sugar|Water|Cornflour|Oil for deep frying",
        "servings": "1 servings",
        "instructions": "Slice the chicken into cubes and add the soya sauce, lime juice, salt and pepper and marinate for 1-2 hours. Secondly, prepare the sweet sauce. Heat a tsp of oil in a wok or pot and add the crushed chilli, the onion, the sugar , one tsp salt, some water and cornflour to thicken. Stir well. Preheat the oil in a wok or pan and add in the chicken piece by piece, turning it around periodically and fry until golden brown. Serve with the sweet sauce hot or cold."
    },
    {
        "title": "Ayam Nanas Lemak (Chicken with Rich Pineapple & Coconut S",
        "ingredients": "400 g Chicken breast|1 cn Pineapple; (cubed)|1 Stalk lemon grass|1/2 cn Coconut milk|3/4 ts Salt|1 ts Sugar|1 sm Onion|1/2 ts Turmeric; (fresh)|2 tb Oil",
        "servings": "1 servings",
        "instructions": "Cut chicken into thin slices, 1/4 inch size. Blend the onion, turmeric. Bash the lemon grass. Heat the oil and add blended onion and the turmeric. Fry for 5 mins and add the lemon grass. Fry for further 5 mins and add the chicken the salt the sugar and the pineapple. Lastly add the coconut milk. Serve hot."
    },
    {
        "title": "Sate Ayam",
        "ingredients": "2 lb Boned and skinned chicken breast halves, cubed|2 md Onion; peeled & quartered|1 Inch fresh ginger; peeled and chopped|2 tb Lemon juice|4 tb Ketjap manis|2 tb Sesame oil|2 tb Sugar|To taste tabasco sauce & cayenne or chili oil|2 tb Coconut milk",
        "servings": "2 Servings",
        "instructions": "Put all ingredients except chicken in blender or food processor. Blend until smooth. Pour over prepared chicken pieces and marinate in refrigerate for several hours. Place chicken on soaked bamboo skewers and broil or grill approximately 20 minutes, turning once."
    },
    {
        "title": "Sate Ayam (Chicken Grilled on Skewers)",
        "ingredients": "750 Grams chicken breast|2 Red chillies or|1/2 ts Sambal oel|2 md Onions; roughly chopped|3 ts Finely chopped fresh ginger|2 ts Lemon juice|1 1/2 ts Salt|2 ts Light soy sauce|2 ts Dark soy sauce|2 ts Sesame oil (important)|2 ts Palm sugar or substitute|(ordinary sugar is ok)|1/2 c Thick coconut milk",
        "servings": "1 Servings",
        "instructions": "Bone chicken and remove skin. Cut into small cubes. In container of electric blender put seeded and roughly chopped chillies, onions, ginger, lemon juice, salt and soy sauce. Blend until smooth, pour into a bowl and stir in oil and sugar. Add chicken and stir until each piece is well coated with the marinade. Cover and marinate for one hour. Chicken can be marinated overnight in the refrigerator. There will be a generous amount of marinade, because this is used as the base for a sauce to serve with the satay. Thread pieces of chicken on bamboo skewers which have been soaked for 1 - 2 hours in cold water, leaving at least half the skewer free at the blunt end. Grill over glowing coals or under a pre-heated griller (broiler), about 5 cm (2 in) from heat source, for 5 - 8 minutes or until chicken is crisp and brown. Brush with extra oil during grilling, once on each side. Pour remaining marinade into a small saucepan, add thick coconut milk and simmer over low heat until smooth and thickened, stirring constantly. Pour into a small bowl and serve with the satay."
    }
]